# 6. Standardizing `groupby`

There are a number of syntaxes that get used for the groupby method. I suggest choosing a single syntax so that all of your code looks the same.

In [9]:
import pandas as pd
pd.set_option('display.max_columns', 100)
college = pd.read_csv('https://raw.githubusercontent.com/MathMachado/Minimally-Sufficient-Pandas/master/data/college.csv')
college= college[['stabbr', 'satmtmid', 'satvrmid', 'ugds']]
college.head(5)

  stabbr  satmtmid  satvrmid     ugds
0     AL     420.0     424.0   4206.0
1     AL     565.0     570.0  11383.0
2     AL       NaN       NaN    291.0
3     AL     590.0     595.0   5451.0
4     AL     430.0     425.0   4811.0

In [10]:
college.shape

(7535, 4)

## The three components of `groupby`

Typically, when calling the `groupby` method, you will be performing an aggregation. This is the by far the most common scenario. When you are performing an aggregation during a `groupby`, there will always be three components.

* **Grouping column** - Unique values form independent groups
* **Aggregating column** - Column whose values will get aggregated. Usually numeric
* **Aggregating function** - How the values will get aggregated (sum, min, max, mean, median, etc...)

![][1]

### Identify each component from image above
* Grouping column - Dept
* Aggregating columns - salary, experience
* Aggregating functions - sum, average

All groupby aggregations will have these three components.

### My syntax of choice for `groupby`
There are a few different syntaxes that Pandas allows to perform a groupby aggregation. The following is the one I use.

```df.groupby('grouping column').agg({'aggregating column': 'aggregating function'})```

[1]: images/sac.png

### A buffet of `groupby` for finding the maximum math SAT score per state
Below, we will go through several different syntaxes that return the same result for finding the maximum SAT score per state.

My preferred way. It handles more complex cases.

In [11]:
college.head()

  stabbr  satmtmid  satvrmid     ugds
0     AL     420.0     424.0   4206.0
1     AL     565.0     570.0  11383.0
2     AL       NaN       NaN    291.0
3     AL     590.0     595.0   5451.0
4     AL     430.0     425.0   4811.0

In [14]:
df = college.groupby('stabbr').agg({'satmtmid': 'max'})
df.head()

        satmtmid
stabbr
AK         503.0
AL         590.0
AR         600.0
AS           NaN
AZ         580.0

The aggregating column can be selected within brackets following the call to `groupby`.

In [16]:
college.groupby('stabbr')['satmtmid'].agg(['max', 'min']).head()

          max    min
stabbr
AK      503.0  503.0
AL      590.0  400.0
AR      600.0  427.0
AS        NaN    NaN
AZ      580.0  480.0

`aggregate` is an alias for `agg`. Always use `agg`.

In [0]:
college.groupby('stabbr')['satmtmid'].aggregate('max').head()

You can call the aggregating method directly without calling `agg`.

In [0]:
college.groupby('stabbr')['satmtmid'].max().head()

### Major benefits of preferred syntax
The reason I choose this syntax, is that it can handle more complex grouping problems. For instance, if we wanted to find the max and min math and verbal sat score along with the average undergrad population per state we would do the following.

In [17]:
df = college.groupby('stabbr').agg({'satmtmid': ['min', 'max'],
                                    'satvrmid': ['min', 'max'],
                                    'ugds': 'mean'}).round(0)
df.head(10)

       satmtmid        satvrmid           ugds
            min    max      min    max    mean
stabbr
AK        503.0  503.0    555.0  555.0  2493.0
AL        400.0  590.0    420.0  595.0  2790.0
AR        427.0  600.0    410.0  600.0  1644.0
AS          NaN    NaN      NaN    NaN  1276.0
AZ        480.0  580.0    485.0  565.0  4130.0
CA        441.0  785.0    435.0  765.0  3518.0
CO        424.0  680.0    475.0  635.0  2325.0
CT        430.0  750.0    425.0  755.0  1874.0
DC        445.0  710.0    430.0  710.0  2645.0
DE        430.0  605.0    430.0  585.0  2491.0

This problem isn't solvable using the other syntaxes. If everyone on your team is using the same syntax, code becomes easier to read.